Repository: leduyquang753/CalcItPascal
Catalog: internationalization/Calculator.*.po
Languages: vi

source: Type any expression to calculate, "help", "vars" to view and select variables, or "exit".
vi: Nhập một biểu thức để tính, "help" để xem trợ giúp, "vars" để xem và chọn các biến, hoặc "exit".

source: ERROR:
vi: LỖI:

source: About
vi: Về chương trình

source: Cancel
vi: Hủy

source: Choose a language
vi: Chọn ngôn ngữ

source: &Variables
vi: &Biến

source: &Calculate
vi: &Tính

source: CalcIt (Pascal port)
vi: CalcIt (bản port sang Pascal)

source: Console
vi: Phản hồi

source: Enter any expression, "help", "vars" or "exit".
vi: Nhập một biểu thức, "help", "vars" hoặc "exit".

source: Input
vi: Nhập

source: EN
vi: VI

source: The value of the latest expression.
vi: Giá trị của biểu thức vừa tính.

# tvariables.buttonclose.caption
source: Close
vi: Đóng

source: Variables
vi: Biến

source: The value of the calculation right before the last.
vi: Giá trị của biểu thức ngay trước biểu thức vừa tính.

source: AND calculation only supports two integers, but given %s and %s.
vi: Phép AND chỉ hỗ trợ hai số nguyên, nhưng lại có %s và %s.

source: Division by zero.
vi: Chia cho không.

source: Invalid numbers: %s; %s.
vi: Số không hợp lệ: %s; %s.

source: Invalid operator placement.
vi: Đặt dấu không hợp lệ.

source: Mixed characters and numbers.
vi: Chữ và số lẫn lộn.

source: Multiple commas in the same number.
vi: Nhiều dấu phẩy trong cùng một số.

source: OR calculation only supports two integers, but given %s and %s.
vi: Phép OR chỉ hỗ trợ hai số nguyên, nhưng lại có %s và %s.

source: Sudden closing brace.
vi: Dấu đóng ngoặc đột ngột.

source: Unexpected end of expression.
vi: Biểu thức kết thúc đột ngột.

source: Unexpected equal sign.
vi: Dấu bằng không hợp lệ.

source: Unexpected percent sign.
vi: Dấu phần trăm không hợp lệ.

source: Unexpected percent sign. Please note that % is not an operator.
vi: Dấu phần trăm không hợp lệ. Xin lưu ý % không phải là toán tử.

source: Unexpected percent sign. Please note that only one percent sign is permitted at the end of a number.
vi: Dấu phần trăm không hợp lệ. Xin lưu ý chỉ một dấu phần trăm được đặt ở cuối một số.

source: Unknown function.
vi: Hàm không hợp lệ.

source: Unknown stuff.
vi: Có thứ không hợp lệ.

source: Unknown symbol.
vi: Kí tự không hợp lệ.

source: Unknown variable.
vi: Biến không hợp lệ.

source: Unmatching closing brace.
vi: Dấu đóng ngoặc không hợp lệ.

source: XOR calculation only supports two integers, but given %s and %s.
vi: Phép XOR chỉ hỗ trợ hai số nguyên, nhưng lại có %s và %s.

source: CalcIt is a simple-to-use Java library/program used to perform single to medium-level mathematic expressions.
vi: CalcIt là một thư viện/chương trình Java đơn giản để tính các biểu thức từ đơn giản đến trung bình.

source: & AND (for integers)
vi: & AND (cho số nguyên)

source: | OR (for integers)
vi: | OR (cho số nguyên)

source: ! XOR (for integers)
vi: ! XOR (cho số nguyên)

source: Functions suported (syntax: <name>([value = 0])):
vi: Các hàm được hỗ trợ (cú pháp: <tên>([giá trị = 0])):

source: sin Trigonometric sine
vi: sin Hàm lượng giác sine

source: cos Trigonometric cosine
vi: cos Hàm lượng giác cosine

source: tan Trigonometric tangent
vi: tan Hàm lượng giác tang

source: cot Trigonometric cotangent
vi: cot Hàm lượng giác cotang

source: log Base 10 logarithm
vi: log Logarid cơ số 10

source: ln Natural (base e) logarithm
vi: ln Logarid tự nhiên (cơ số e)

source: This program is a port to Delphi for a GUI and ease of use (no need to install a JRE).
vi: Chương trình là một bản port sang Dephi để có một GUI và dễ sử dụng (không phải cài JRE).

source: The program takes operators' priorities into account.
vi: Chương trình có tính đến thứ tự ưu tiên của các biểu thức.

source: Version %s built at %s. Copyright © 2019 Lê Duy Quang
vi: Phiên bản %s dựng lúc %s. Bản quyền © 2019 Lê Duy Quang

source: Operators supported:
vi: Các toán tử được hỗ trợ:

source: + Addition
vi: + Cộng

source: - Subtraction
vi: - Trừ

source: . Multiplication
vi: . Nhân

source: : Division
vi: : Chia

source: ^ Exponentiation
vi: ^ Lũy thừa

source: v Root
vi: v Căn
